InformationRegisters/DMS_АдресаРазгрузкиДилеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_АдресаРазгрузкиДилеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>BIR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>idТочка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SKLAD_CODE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_АдресаРазгрузкиДилеров/Ext/ManagerModule.bsl
Процедура ДобавитьАдресРазгрузки(BIR, idТочка, Адрес) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.DMS_АдресаРазгрузкиДилеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.BIR = BIR;
	МенеджерЗаписи.idТочка = idТочка;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() И (МенеджерЗаписи.Адрес <> Адрес) Тогда
		МенеджерЗаписи.Адрес = Адрес;
		МенеджерЗаписи.Записать();
	ИначеЕсли Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.BIR = BIR;
		МенеджерЗаписи.idТочка = idТочка;
		МенеджерЗаписи.Адрес = Адрес;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьРегистр() Экспорт
	
	НаборЗаписей = РегистрыСведений.DMS_АдресаРазгрузкиДилеров.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьАдреСит(BIR, idТочка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.DMS_АдресаРазгрузкиДилеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.BIR = BIR;
	МенеджерЗаписи.idТочка = idТочка;
	МенеджерЗаписи.Прочитать();
	
	Возврат Новый Структура("Адрес", МенеджерЗаписи.Адрес);
	
КонецФункции

Функция ДляДилераЕстьТочки(BIR) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АдресаРазгрузкиДилеров.BIR,
		|	АдресаРазгрузкиДилеров.idТочка,
		|	АдресаРазгрузкиДилеров.Адрес
		|ИЗ
		|	РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК АдресаРазгрузкиДилеров
		|ГДЕ
		|	АдресаРазгрузкиДилеров.BIR = &BIR";
	Запрос.УстановитьПараметр("BIR", BIR);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции
